brew 'flow'
brew 'git'
# Override default Vim installation.
# By default, OSX has an older version of Vim installed.
brew 'macvim', args: [ '--override-system-vim' ]
brew 'python'
brew 'python3'
brew 'tmux'
brew 'watchman'
# Install yarn using nvm's version of Node.js.
brew 'yarn', args: [ '--ignore-dependencies' ]

cask_args appdir: '/Applications'

cask 'adobe-reader'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
cask 'atom'
cask 'codekit'
cask 'docker'
cask 'docker-toolbox'
cask 'firefox'
cask 'framer'
cask 'google-chrome'
cask 'google-drive'
cask 'hyper'
cask 'intellij-idea'
cask 'java'
cask 'mapbox-studio'
cask 'mysqlworkbench'
cask 'pycharm'
cask 'sketch'
cask 'slack'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'webstorm'