# Override default Vim installation.
# By default, OSX has an older version of Vim installed.
brew 'macvim', args: [ '--override-system-vim' ]
# Install yarn using nvm's version of Node.js.
brew 'yarn', args: [ '--ignore-dependencies' ]

cask_args appdir: '/Applications'

cask 'adobe-reader'
cask 'atom'
cask 'docker'
cask 'docker-toolbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'hyper'
cask 'mapbox-studio'
cask 'mysqlworkbench'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'